Tekla.Structures.Geometry3d.Line
The Line class represents a single infinite line in 3D space. See LineSegment for
the implementation of a segment of a line.

Tekla.Structures.Geometry3d.Line.Origin
The origin of the line.

Tekla.Structures.Geometry3d.Line.Direction
The direction vector of the line.

Tekla.Structures.Geometry3d.Line.#ctor
Instantiates a line with an undefined direction.

Tekla.Structures.Geometry3d.Line.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Instantiates a line defined by the given points.
p1: The first point to be used.
p2: The second point to be used.

Tekla.Structures.Geometry3d.Line.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector)
Instantiates a line defined by the given point and direction vector.
Point: A point that will be on the line.
Direction: The direction of the line.

Tekla.Structures.Geometry3d.Line.#ctor(Tekla.Structures.Geometry3d.LineSegment)
Instantiates a line defined by the given line segment.
LineSegment: The line segment to be used.